Tekla.Structures.DrawingInternal.DocumentManagerController
User interface drawings.

Tekla.Structures.DrawingInternal.DocumentManagerController.DrawingChanged
Drawing changed event.

Tekla.Structures.DrawingInternal.DocumentManagerController.ShowWindowRequested
Show window requested event.

Tekla.Structures.DrawingInternal.DocumentManagerController.GetSelectedDrawingGuidsFunc
Get selected drawing guids delegate.

Tekla.Structures.DrawingInternal.DocumentManagerController.GetVisibleDrawingIdsFunc
Get visible drawing ids delegate.

Tekla.Structures.DrawingInternal.DocumentManagerController.SetSelectedDrawingsFunc
Gets or sets the set selected drawings function.

Tekla.Structures.DrawingInternal.DocumentManagerController.ShowWindow
The show window function.

Tekla.Structures.DrawingInternal.DocumentManagerController.GetSelectedDrawingGuids
The selected drawing guids function.
Returns: The selected drawing guids.

Tekla.Structures.DrawingInternal.DocumentManagerController.SetSelectedDrawings(System.Collections.Generic.IEnumerable{System.Int32})
Set selected drawings.
drawingIds: The drawing ids.

Tekla.Structures.DrawingInternal.DocumentManagerController.GetVisibleDrawingIds
The visible drawing ids function.
Returns: The visible drawing ids.

Tekla.Structures.DrawingInternal.DocumentManagerController.UpdateDocumentManager(System.Boolean,System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32)
Update document manager.
newDrawingIsNotNull: Whether the new drawing is not null.
newId: The new id.
newType: The new type.
oldDrawingIsNotNull: Whether the old drawing is not null.
oldId: The old id.
oldType: The old type.